#include<stdio.h>                                       /*包含头文件*/

int main()                                              /*主函数main*/
{
    int i,a[10]={1,5,6,8,2,1,4,5,2,5},b[10]={0};		/*定义数组*/
    for(i=0;i<10;i++)                                   /*循环数组中的每个值*/
        b[a[i]]++;                                      /*统计出现的次数*/
    for(i=0;i<10;i++)                                   /*从0-9依次循环*/
        printf("%d出现的次数%d\n",i,b[i]);              /*显示输出次数结果*/
     
	return 0;                                           /*程序结束*/
}