#include <stdio.h>
int main()
{
	int i,j;
    double a[10]={1.4,1.393,0.92,0.862,0.553,0.411,0.164,0.259,0.394,0.562};
	double iTemp; 
	 
	/*从大到小排序*/
	for(i=0;i<9;i++) 				/*外层循环元素下标为0~8*/
	{ 
		for(j=i+1;j<10;j++) 			/*内层循环元素下标为i+1到9*/
		{ 
			if(a[j]>a[i]) 			/*如果当前值比其他值小*/
			{ 
				/*交换两个数值*/
				iTemp = a[i]; 
				a[i]  = a[j]; 
				a[j]  = iTemp; 
			} 
		} 
	}

	/*输出数组*/
	for(i=0;i<10;i++)
	{
		printf("%f\t",a[i]);		/*输出制表位*/
		if(i == 4)					/*如果是第5个元素*/
			printf("\n");		    /*输出换行*/
	}

	return 0;						/*程序结束*/
}
